---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadParam
source: html/5ba58430-ab72-cf13-a942-4f43873ad9c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadParam Property

"Total Estimated Demand"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalestloadParam { get; }
```